# Datos del Titanic

In [4]:
import seaborn as sns
import numpy as np
import pandas as pd

In [3]:
titanic = sns.load_dataset("titanic")

URLError: <urlopen error [Errno 0] Error>

In [5]:
titanic = pd.read_csv("../../seaborn-data/titanic.csv")

In [6]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.shape

(891, 15)

In [8]:
titanic['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [9]:
titanic['survived'] = pd.Categorical(titanic['survived'])

In [11]:
titanic['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: category
Categories (2, int64): [0, 1]

In [12]:
titanic['pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

In [14]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [15]:
titanic['pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: category
Categories (3, int64): [1, 2, 3]

In [16]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [17]:
titanic['deck'] = pd.Categorical(titanic['deck'])

In [18]:
titanic['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

## Tablas de frecuencias de una variable

In [19]:
tab = pd.crosstab(index = titanic['survived'],
                 columns = 'pasajeros')
tab

col_0     pasajeros
survived
0               549
1               342

In [20]:
type(tab)

pandas.core.frame.DataFrame

In [22]:
tab_pc=pd.crosstab(index = titanic['pclass'],
           columns = "pasajeros")
tab_pc

col_0   pasajeros
pclass
1             216
2             184
3             491

In [23]:
tab_pc.sum()

col_0
pasajeros    891
dtype: int64

In [25]:
tab_sex = pd.crosstab(index = titanic['sex'], 
           columns = "pasajeros")
tab_sex

col_0   pasajeros
sex
female        314
male          577

In [28]:
tab_c = pd.crosstab(index = titanic['deck'],
           columns = "count")
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [19]:
tab_c.sum()

col_0
count    203
dtype: int64

In [20]:
tab_c.shape

(7, 1)

In [21]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [29]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

#### mini ejercicio

In [27]:
100*round(tab_sex/tab_sex.sum(),3)

col_0   pasajeros
sex
female       35.2
male         64.8

In [30]:
tab/tab.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

In [37]:
tab_pc_r = tab_pc/tab_pc.sum()
tab_pc_r.loc[3,:]

col_0
pasajeros    0.551066
Name: 3, dtype: float64

In [38]:
tab_pc_r

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

## Tablas de contingencia de dos variables

In [40]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'])
survived_sex.index = ["died", "survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [41]:
survived_class = pd.crosstab(index = titanic['survived'], 
                            columns = titanic['pclass'],
                            margins = True)

survived_class.index = ["murio", "sobrevivio", "total_clase"]
survived_class.columns = ["primera", "segunda", "tercera", "total_superv"]
survived_class

             primera  segunda  tercera  total_superv
murio             80       97      372           549
sobrevivio       136       87      119           342
total_clase      216      184      491           891

### Frecuencias relativas globales

In [42]:
survived_class/survived_class.loc["total_clase", "total_superv"]

              primera   segunda   tercera  total_superv
murio        0.089787  0.108866  0.417508      0.616162
sobrevivio   0.152637  0.097643  0.133558      0.383838
total_clase  0.242424  0.206510  0.551066      1.000000

### Frecuencias relativas marginales

In [33]:
survived_class/survived_class.loc["total_clase"]

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [38]:
survived_class.div(survived_class.loc["total_clase"], axis = 1)

             primera   segunda   tercera  total_superv
murio        0.37037  0.527174  0.757637      0.616162
sobrevivio   0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [36]:
survived_class.T/survived_class["total_superv"]

                 murio  sobrevivio  total_clase
primera       0.145719    0.397661     0.242424
segunda       0.176685    0.254386     0.206510
tercera       0.677596    0.347953     0.551066
total_superv  1.000000    1.000000     1.000000

In [37]:
survived_class.div(survived_class["total_superv"], axis = 0)

              primera   segunda   tercera  total_superv
murio        0.145719  0.176685  0.677596           1.0
sobrevivio   0.397661  0.254386  0.347953           1.0
total_clase  0.242424  0.206510  0.551066           1.0

## Tablas multi dimensionales

In [83]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                             colnames = ["sexo","clase"],
                             rownames = ["suerte"],
                            margins = True)
ssc2 = surv_sex_class.copy()
ssc2.index = ["fallecidos", "supervivientes", "total"]
surv_sex_class.index = ["fallecidos", "supervivientes", "total"]
ssc2.columns = [('femenino',1),
                ('femenino',2),
                ('femenino',3),
                ('masculino','primera'),
                ('masculino','segunda'),
                ('masculino','tercera'),
                ('todos', '')]

# lo he hecho dandole a la ayuada (shift+tab) sobre columns y ahi aparecía la estrucctura multiindice
ssc2

,"(femenino, 1)","(femenino, 2)","(femenino, 3)","(masculino, primera)","(masculino, segunda)","(masculino, tercera)","(todos, )"
fallecidos,3,6,72,77,91,300,549
supervivientes,91,70,72,45,17,47,342
total,94,76,144,122,108,347,891

In [79]:
ssc2.div(ssc2['todos',''],axis=0)

,"(femenino, 1)","(femenino, 2)","(femenino, 3)","(masculino, primera)","(masculino, segunda)","(masculino, tercera)","(todos, )"
fallecidos,0.005464,0.010929,0.131148,0.140255,0.165756,0.546448,1.0
supervivientes,0.266082,0.204678,0.210526,0.131579,0.049708,0.137427,1.0
total,0.105499,0.085297,0.161616,0.136925,0.121212,0.389450,1.0

In [80]:
ssc2.div(ssc2.loc['total'],axis = 1)

,"(femenino, 1)","(femenino, 2)","(femenino, 3)","(masculino, primera)","(masculino, segunda)","(masculino, tercera)","(todos, )"
fallecidos,0.031915,0.078947,0.5,0.631148,0.842593,0.864553,0.616162
supervivientes,0.968085,0.921053,0.5,0.368852,0.157407,0.135447,0.383838
total,1.000000,1.000000,1.0,1.000000,1.000000,1.000000,1.000000

In [84]:
surv_sex_class["female"]

clase            1   2    3
fallecidos       3   6   72
supervivientes  91  70   72
total           94  76  144

In [85]:
surv_sex_class["female"][1]

fallecidos         3
supervivientes    91
total             94
Name: 1, dtype: int64

In [87]:
surv_sex_class/surv_sex_class.loc["total"]

sexo              female                     male                      \
clase                  1         2    3         1         2         3
fallecidos      0.031915  0.078947  0.5  0.631148  0.842593  0.864553
supervivientes  0.968085  0.921053  0.5  0.368852  0.157407  0.135447
total           1.000000  1.000000  1.0  1.000000  1.000000  1.000000

sexo                 All
clase
fallecidos      0.616162
supervivientes  0.383838
total           1.000000